content-org/all-posts.org
#+title: Hammond's Blog And Class Posts
#+hugo_base_dir: ../
#+MACRO: more @@hugo:<!--more-->@@
#   to use this one, write {{{more}}}
#+MACRO: youtube @@hugo:{{< youtube id="$1" >}}@@
#  to use this, write {{{youtube(ID)}}}
#+hugo_paired_shortcodes: spoiler
#  to use this, write:
#     #+begin_spoiler
#      You need to click to see this, my friend.
#     #+end_spoiler

** Week 7
:PROPERTIES:
:EXPORT_FILE_NAME: Week7
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :ShowBreadCrumbs true
:END:

Your todo list for the week
{{{more}}}

*** Solutions to Checkpoint 6
[[https://nextcloud.math.wichita.edu/index.php/s/Qn25teKK9Tpz8Ao][Here's the original checkpoint file]]

[[https://nextcloud.math.wichita.edu/index.php/s/dK4ENbnsqGeWaMF][and here are the solutions]]

*** Before class on Tuesday
:PROPERTIES:
:CUSTOM_ID: before-class-on-tuesday-13
:END:
**** 📚 Read / Watch
:PROPERTIES:
:CUSTOM_ID: read-watch-10
:END:
- [[https://www.math.wichita.edu/~hammond/class-notes/section-multiplicative-inverses.html][Multiplicative
  Inverses]]
- [[https://www.math.wichita.edu/~hammond/class-notes/section-numtheory-modularexp.html][Modular
  Exponentiation]]

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework-21
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please as questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental
  textbooks if you need/want:
  [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and
  [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied
  Discrete Structures]].

**** Questions?
:PROPERTIES:
:CUSTOM_ID: questions-18
:END:
Ask it on Discourse, and let's get it answered!

--------------

*** 🎥 Tuesday recitation
:PROPERTIES:
:CUSTOM_ID: tuesday-recitation-13
:END:
{{{youtube(uRzfjfPErJc)}}}

--------------

*** Before Class on Thursday
:PROPERTIES:
:CUSTOM_ID: before-class-on-thursday-12
:END:
**** Readings / Videos
:PROPERTIES:
:CUSTOM_ID: readings-videos-11
:END:
[[https://www.math.wichita.edu/~hammond/class-notes/section-numtheory-encryption.html][Application:
Encryption through 3.6.6]]

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework-22
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please as questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental
  textbooks if you need/want:
  [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and
  [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied
  Discrete Structures]].

**** Questions?
:PROPERTIES:
:CUSTOM_ID: questions-19
:END:
Ask it on Discourse, and let's get it answered!

--------------

*** 🎥 Thursday recitation
:PROPERTIES:
:CUSTOM_ID: thursday-recitation-12
:END:
{{{youtube(T0igEQ5GSA0)}}}

