content/math321/Week7.md
+++
title = "Week 7"
author = ["John Hammond"]
draft = false
ShowBreadCrumbs = true
+++

Your todo list for the week
<!--more-->

## Solutions to Checkpoint 6

[Here's the original file](https://nextcloud.math.wichita.edu/index.php/s/sY2xC5AsmX6Me8N)

[Here are the solutions](https://nextcloud.math.wichita.edu/index.php/s/E7EWwSTEzNr5dRG)

## Before class on Tuesday {#before-class-on-tuesday-13}


### 📚 Read / Watch {#read-watch-10}

-   [Multiplicative
    Inverses](https://www.math.wichita.edu/~hammond/class-notes/section-multiplicative-inverses.html)
-   [Modular
    Exponentiation](https://www.math.wichita.edu/~hammond/class-notes/section-numtheory-modularexp.html)


### 📝 Homework {#homework-21}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please as questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental
    textbooks if you need/want:
    [DMOI](http://discrete.openmathbooks.org/dmoi3/) and
    [Applied
    Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Questions? {#questions-18}

Ask it on Discourse, and let's get it answered!

---


## 🎥 Tuesday recitation {#tuesday-recitation-13}

****to be posted****

---


## Before Class on Thursday {#before-class-on-thursday-12}


### Readings / Videos {#readings-videos-11}

[Application:
Encryption through 3.6.6](https://www.math.wichita.edu/~hammond/class-notes/section-numtheory-encryption.html)


### 📝 Homework {#homework-22}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please as questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental
    textbooks if you need/want:
    [DMOI](http://discrete.openmathbooks.org/dmoi3/) and
    [Applied
    Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Questions? {#questions-19}

Ask it on Discourse, and let's get it answered!

---


## 🎥 Thursday recitation {#thursday-recitation-12}

****to be posted****
